# Задача 1
# Есть строка с перечислением песен

my_favorite_songs = 'Waste a Moment, Staying\' Alive, A Sorta Fairytale, Start Me Up, New Salvation'
songs_list = my_favorite_songs.split(', ')
songs = songs_list[0], songs_list[-1], songs_list[1], songs_list[-2]

print(*songs, sep="\n")

# Выведите на консоль с помощью индексации строки, последовательно: первый трек, последний, второй, второй с конца
# Нельзя переопределять my_favorite_songs и запятая не должна выводиться
